import React from 'react';
import CardBack from './CardBack';

export default {
  component: CardBack,
  title: 'CardBack',
  argTypes: {
    
  }
};

const Template = (args) => <CardBack {...args} />;

export const Default = Template.bind({});
Default.args = {
  player: {
    "영어 이름": "KWON KANG HYUN",
    "이름": "권강현",
    "등번호": 29,
    "포지션": "P",
    "특수 항목": "0.2이닝",
    "특수 항목 점수": 7,
    "코멘트": "방향을 먼저 잡은 후에 속도를 내야합니다. \n인생도, \n공부도, \n야구도.",
    "명대사": "\"Easy.\" \n- 전혀 Easy 하지 않았음."
  },
  data: 
    [
      {
          "이름": "권강현",
          "IP": 22,
          "ERA": 79,
          "K/9": 37,
          "H/9": 90,
          "컨트롤": 30,
          "WHIP": 95
      },
      {
          "이름": "김병진",
          "IP": 44,
          "ERA": 83,
          "K/9": 51,
          "H/9": 88,
          "컨트롤": 30,
          "WHIP": 97
      },
      {
          "이름": "김형준",
          "IP": 69,
          "ERA": 100,
          "K/9": 100,
          "H/9": 100,
          "컨트롤": 30,
          "WHIP": 100
      },
      {
          "이름": "류동현",
          "IP": 56,
          "ERA": 86,
          "K/9": 68,
          "H/9": 92,
          "컨트롤": 30,
          "WHIP": 98
      },
      {
          "이름": "조태형",
          "IP": 100,
          "ERA": 84,
          "K/9": 63,
          "H/9": 93,
          "컨트롤": 30,
          "WHIP": 98
      },
  ]
};

export const Pitcher = Template.bind({});
Pitcher.args = {
  player: {
    "영어 이름": "KWON KANG HYUN",
    "이름": "권강현",
    "등번호": 29,
    "포지션": "P",
    "특수 항목": "0.2이닝",
    "특수 항목 점수": 7,
    "코멘트": "방향을  먼저 잡은 후에 속도를 내야합니다. \n인생도, 공부도, 야구도.",
    "명대사": "\"Easy.\" \n- 전혀 Easy 하지 않았음."
  },
  data: 
    [
      {
          "이름": "권강현",
          "IP": 22,
          "ERA": 79,
          "K/9": 37,
          "H/9": 90,
          "컨트롤": 30,
          "WHIP": 95
      },
      {
          "이름": "김병진",
          "IP": 44,
          "ERA": 83,
          "K/9": 51,
          "H/9": 88,
          "컨트롤": 30,
          "WHIP": 97
      },
      {
          "이름": "김형준",
          "IP": 69,
          "ERA": 100,
          "K/9": 100,
          "H/9": 100,
          "컨트롤": 30,
          "WHIP": 100
      },
      {
          "이름": "류동현",
          "IP": 56,
          "ERA": 86,
          "K/9": 68,
          "H/9": 92,
          "컨트롤": 30,
          "WHIP": 98
      },
      {
          "이름": "조태형",
          "IP": 100,
          "ERA": 84,
          "K/9": 63,
          "H/9": 93,
          "컨트롤": 30,
          "WHIP": 98
      },
  ]
};


export const Batter = Template.bind({});
Batter.args = {
  player: {
    "영어 이름": "KWON HUCK JIN",
    "이름": "권혁진",
    "등번호": 10,
    "포지션": "1B",
    "특수 항목": "비버마스터",
    "특수 항목 점수": 1,
    "코멘트": "포수 포지션 경쟁 끝에 새로운 집을 짓기로 한 비버마스터.\n아이쿠, 이미 1루에 자리잡으려는 세력들이 있군요.\n탄탄한 집을 짓는 비버들과 외야에서 쫒겨나 흉폭한 비버까지.\n비버마스터 혁진권은 이번에야말로 자신의 집을 완성할 수 있을까요?",
    "코멘트 스타일": "[{\"fontFamily\": \"Dongle\", \"fontSize\": \"20px\"}, {\"fontFamily\": \"Dongle\"},{\"fontFamily\": \"Dongle\"},{\"fontFamily\": \"Dongle\"},{\"fontFamily\": \"Dongle\"}]",
    "명대사": "\"감독님 하반기 목표 있습니다. 하반기 주전 1루 먹을겁니다.\"\n-전혀 먹지 못했음."
  },
  data: 
  [
    {
        "이름": "권혁진",
        "PA": 37,
        "BA": 47,
        "RBI": 25,
        "SB": 2,
        "DEF": 30,
        "OPS": 37,
        "V.C": 64
    },
    {
        "이름": "김기태",
        "PA": 79,
        "BA": 74,
        "RBI": 95,
        "SB": 31,
        "DEF": 30,
        "OPS": 72,
        "V.C": 83
    },
    {
        "이름": "김민석",
        "PA": 6,
        "BA": 0,
        "RBI": 15,
        "SB": 0,
        "DEF": 30,
        "OPS": 0,
        "V.C": 100
    },
    {
        "이름": "김범희",
        "PA": 84,
        "BA": 54,
        "RBI": 75,
        "SB": 17,
        "DEF": 30,
        "OPS": 70,
        "V.C": 64
    },
    {
        "이름": "김재영",
        "PA": 100,
        "BA": 100,
        "RBI": 95,
        "SB": 100,
        "DEF": 30,
        "OPS": 98,
        "V.C": 86
    },
    {
        "이름": "김태양",
        "PA": 37,
        "BA": 39,
        "RBI": 20,
        "SB": 12,
        "DEF": 30,
        "OPS": 29,
        "V.C": 75
    },
    {
        "이름": "김현철",
        "PA": 14,
        "BA": 28,
        "RBI": 5,
        "SB": 2,
        "DEF": 30,
        "OPS": 29,
        "V.C": 88
    },
    {
        "이름": "김형준",
        "PA": 83,
        "BA": 90,
        "RBI": 100,
        "SB": 19,
        "DEF": 30,
        "OPS": 100,
        "V.C": 83
    },
    {
        "이름": "김희제",
        "PA": 25,
        "BA": 0,
        "RBI": 5,
        "SB": 5,
        "DEF": 30,
        "OPS": 16,
        "V.C": 40
    },
    {
        "이름": "남동수",
        "PA": 32,
        "BA": 25,
        "RBI": 20,
        "SB": 2,
        "DEF": 30,
        "OPS": 19,
        "V.C": 50
    },
    {
        "이름": "박영준",
        "PA": 19,
        "BA": 50,
        "RBI": 10,
        "SB": 5,
        "DEF": 30,
        "OPS": 9,
        "V.C": 43
    },
    {
        "이름": "박재현",
        "PA": 57,
        "BA": 88,
        "RBI": 45,
        "SB": 14,
        "DEF": 30,
        "OPS": 74,
        "V.C": 67
    },
    {
        "이름": "백정철",
        "PA": 35,
        "BA": 58,
        "RBI": 20,
        "SB": 10,
        "DEF": 30,
        "OPS": 58,
        "V.C": 86
    },
    {
        "이름": "이동진",
        "PA": 46,
        "BA": 16,
        "RBI": 30,
        "SB": 14,
        "DEF": 30,
        "OPS": 24,
        "V.C": 21
    },
    {
        "이름": "이철민",
        "PA": 70,
        "BA": 57,
        "RBI": 40,
        "SB": 21,
        "DEF": 30,
        "OPS": 56,
        "V.C": 68
    },
    {
        "이름": "임지헌",
        "PA": 29,
        "BA": 55,
        "RBI": 5,
        "SB": 14,
        "DEF": 30,
        "OPS": 34,
        "V.C": 64
    },
    {
        "이름": "차현철",
        "PA": 25,
        "BA": 15,
        "RBI": 0,
        "SB": 5,
        "DEF": 30,
        "OPS": 13,
        "V.C": 77
    }
]
};

